DSU/src/Documents/КорректировкаДолга/КорректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаДолга</name>
  <registerRecords>AccumulationRegister.ДолговыеОбязательства</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыДолговыхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжникСписания</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаСписания</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжникУвеличения</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУвеличения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУвеличения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвертироватьКурс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

DSU/src/Enums/ВидыДолговыхОпераций/ВидыДолговыхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДолговыхОпераций</name>
  <enumValues>
    <name>СписаниеДолга</name>
  </enumValues>
  <enumValues>
    <name>УвеличениеДолга</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолга</name>
  </enumValues>
</mdclass:Enum>

DSU/src/Documents/КорректировкаДолга/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем ДниНедели;

&НаКлиенте
Процедура ВидОперацииОчистка(Элемент, СтандартнаяОбработка)
	
	// не будем давать очищать этот реквизит, так как без него неясен смысл и интерфейс документа
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура УправлениеВидимостьюРеквизитов()
	
	Если Объект.ВидОперации = Перечисления.ВидыДолговыхОпераций.СписаниеДолга Тогда
		ВидимостьСписанияДолга = Истина;
		ВидимостьУвеличенияДолга = Ложь;
		ВидимостьКурсаКратности = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыДолговыхОпераций.УвеличениеДолга Тогда
		ВидимостьСписанияДолга = Ложь;
		ВидимостьУвеличенияДолга = Истина;
		ВидимостьКурсаКратности = Ложь;
	Иначе
		ВидимостьСписанияДолга = Истина;
		ВидимостьУвеличенияДолга = Истина;
		ВидимостьКурсаКратности = Истина;
	КонецЕсли;	
	
	Элементы.ГруппаСписаниеДолга.Видимость = ВидимостьСписанияДолга;
	Элементы.ГруппаУвеличениеДолга.Видимость = ВидимостьУвеличенияДолга;
	Элементы.ГруппаКурс.Видимость = ВидимостьКурсаКратности;
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеВидимостьюРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеВидимостьюРеквизитов();	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСписанияПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДолговыхОпераций.ПереносДолга") И Не ЗначениеЗаполнено(Объект.СуммаУвеличения) Тогда
		Если ЗначениеЗаполнено(Объект.Кратность) И ЗначениеЗаполнено(Объект.Курс) Тогда
			Если Объект.ИнвертироватьКурс Тогда
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Кратность / Объект.Курс;
			Иначе	
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Курс / Объект.Кратность;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаУвеличенияПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДолговыхОпераций.ПереносДолга") И Не ЗначениеЗаполнено(Объект.СуммаСписания) Тогда
		Если ЗначениеЗаполнено(Объект.Курс) И ЗначениеЗаполнено(Объект.Курс) Тогда
			Если Объект.ИнвертироватьКурс Тогда
				Объект.СуммаСписания = Объект.СуммаУвеличения * Объект.Курс / Объект.Кратность;
			Иначе	
				Объект.СуммаСписания = Объект.СуммаУвеличения * Объект.Кратность / Объект.Курс;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДолговыхОпераций.ПереносДолга") Тогда
		Если ЗначениеЗаполнено(Объект.Кратность) И ЗначениеЗаполнено(Объект.Курс) Тогда
			Если Объект.ИнвертироватьКурс Тогда
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Кратность / Объект.Курс;
			Иначе	
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Курс / Объект.Кратность;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьКурсПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДолговыхОпераций.ПереносДолга") Тогда
		Если ЗначениеЗаполнено(Объект.Кратность) И ЗначениеЗаполнено(Объект.Курс) Тогда
			Если Объект.ИнвертироватьКурс Тогда
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Кратность / Объект.Курс;
			Иначе	
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Курс / Объект.Кратность;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КратностьПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДолговыхОпераций.ПереносДолга") Тогда
		Если ЗначениеЗаполнено(Объект.Кратность) И ЗначениеЗаполнено(Объект.Курс) Тогда
			Если Объект.ИнвертироватьКурс Тогда
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Кратность / Объект.Курс;
			Иначе	
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Курс / Объект.Кратность;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДниНедели = ОбщегоНазначенияКлиент.ПолучитьСоответствиеДнейНедели();
	ОбщегоНазначенияКлиент.ОбновитьНадписьДеньНедели(Элементы.ДеньНедели, ДниНедели, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиент.ОбновитьНадписьДеньНедели(Элементы.ДеньНедели, ДниНедели, Объект);
	
КонецПроцедуры
